Tekla Open API Reference for Tekla Structures 2025
Color Properties
The Color type exposes the following members.
Properties
Name | Description
Blue
 The blue value of the color, between 0.0 and 1.0.
Green
 The green value of the color, between 0.0 and 1.0.
Red
 The red value of the color, between 0.0 and 1.0.
Transparency
 The transparency value of the color, between 0.0 (completely see-through) and 1.0 (completely solid).
Top
See Also
Reference
Color Class
Tekla.Structures.Model.UI Namespace